// ตัวดำเนินการทางตรรกศาสตร์

// และ and = &&
// หรือ or = ||

//ture,false

// ตัวอย่างการทำงาน 1 (and)
// โจทย์ นายAต้องซื้อเงาะและมะม่วง จากนั้นถึงจะกลับบ้านได้

// a = ซื้้อเงาะ
// b = ซื้อมะม่วง

// a = ture && b = ture => a && b = กลับบ้านได้ (ture)
// a = ture && b = flase => a && b = กลับบ้านไม่ได้ (false)

// ตัวอย่างการทำงาน 1 (or)
// โจทย์ นายAต้องซื้อเงาะหรือมะม่วง จากนั้นถึงจะกลับบ้านได้

// a = ซื้้อเงาะ
// b = ซื้อมะม่วง

// a = ture && b = ture => a && b = กลับบ้านได้ (ture)
// a = ture && b = false => a && b = กลับบ้านได้ (ture)
// a = flase && b = ture => a && b = กลับบ้านได้ (ture)
// a = flase && b = false => a && b = กลับบ้านไม่ได้ (false)

// ตัวอย่างโปรแกรม

// 80 - 100 = A
// 75 - 79 = B+
// 70 - 74 = B
// 65 - 69 = C+
// 60 - 64 = C
// 55 - 59 = D+
// 50 - 54 = D
// 0-49 = F

let score = 100;

console.log (score >= 70 && score <=80) //และคือต้องเป็นจริงทั้งคู่ ถึงจะแสดงค่าเป็นจริง Ture
console.log (score >= 70 || score <=80) //หรือคือมีเพียงค่าใดค่าหนึ่งที่เป็นจริง ถึงจะแสดงค่าเป็นจริง Ture
